Ch5 Getting Started with pandas

Pandas contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python.

#numpy vs pandas: 
pandan is designed for working wiht tabular or heterogeneous data
numpy is best for homogeneous numerical array data

In [ ]:
# https://jupyter-notebook.readthedocs.io/en/stable/notebook.html
# https://pandas.pydata.org/pandas-docs/stable/user_guide/index.html

In [37]:

# Ch5 Pandas
# import Series and DataFrame into the local namespace since they are so frequently used:

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

page 130
DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection of columns,
each of which can be a different value type (numeric, string, boolean, etc.). 

The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index.

In [52]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

print(frame)
print('------------------')
print(frame.head())  # show the first five rows
print('------------------')
print(frame.head(2))  # show the first 2 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
------------------
    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
------------------
  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [55]:
res = pd.DataFrame(data, columns=['year', 'state', 'pop'])
res

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [76]:
print(res.head(3))
print('------------------')
res.head()    # five records

   year state  pop
0  2000  Ohio  1.5
1  2001  Ohio  1.7
2  2002  Ohio  3.6
------------------

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [72]:
res

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [77]:
# one column
print(res['year'])
print('------------------')

# rows: use .loc
print(res['year'].loc[0])
print('------------------')
print(res['year'].loc[[0,1,3]])

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
------------------
2000
------------------
0    2000
1    2001
3    2001
Name: year, dtype: int64

In [79]:
# columns
print(res[['year','state']])
print('------------------')
print(res[['year','state']].head(3))

print('------------------')
print(res[['year','state']].loc[1])
print('------------------')
print(res[['year','state']].loc[[1,2,3]])
print('------------------')

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada
   year state
0  2000  Ohio
1  2001  Ohio
2  2002  Ohio
------------------
year     2001
state    Ohio
Name: 1, dtype: object
------------------
   year   state
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
------------------

In [80]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [81]:
print(frame2.columns)
print(frame2.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [82]:
# A column in a DataFrame can be retrieved as a Series
# frame2[column] works for any column name, but frame2.column only works when the column name is a valid Python variable
# name.
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [83]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [63]:
print(frame2.state, frame2.year)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [84]:
# Row
print(frame2.loc['three'])
print('------------------------')
print(frame2.loc[['one','three']])

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object
------------------------
       year state  pop debt
one    2000  Ohio  1.5  NaN
three  2002  Ohio  3.6  NaN

In [35]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [85]:
# Column can be modifed by assignment
frame2['debt'] = 1.6
print(frame2)

print('------------------------')
frame2['debt'] = np.arange(6.0)
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   1.6
two    2001    Ohio  1.7   1.6
three  2002    Ohio  3.6   1.6
four   2001  Nevada  2.4   1.6
five   2002  Nevada  2.9   1.6
six    2003  Nevada  3.2   1.6
------------------------
       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [86]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [87]:
# Add a new column

#frame2['eastern'] = frame2.state == 'Ohio'
res = frame2.state == 'Ohio'
print(col)
frame2['eastern'] = res
frame2

one       True
two       True
three     True
four     False
five     False
six      False
Name: state, dtype: bool

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [88]:
# Delete a colun
del frame2['eastern']

print(frame2.columns)
frame2

Index(['year', 'state', 'pop', 'debt'], dtype='object')

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [89]:
# Build a Dataframe from dictionary
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

#notice that index : no 2000, add 2003
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [92]:
print('\n-----------')
frame4 = pd.DataFrame(pop,index=[2001, 2002, 2003]) 
print(frame4)

-----------
      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

print(frame3)
print('---')
print(frame3['Ohio'][:-1])
print('---')
print(frame3['Nevada'][:2])
print('---')
print(pdata)

print('---')
f5 = pd.DataFrame(pdata)
print(f5)

In [95]:
print(frame4)
# Transtation
f4 = frame4.T
print('---------')
print(f4)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN
---------
        2001  2002  2003
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   NaN

In [96]:
# Give name to index and columns:
print(frame3)  # before
print('------------')
frame3.index.name = 'year';frame3.columns.name = 'state'
print(frame3)  # after

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
------------
state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [97]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [98]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [63]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [99]:
# 3 Index Objects
obj = pd.Series(range(3), index=['a', 'b', 'c'])
print(obj)
index = obj.index
#index[1]='d'  # Error, Index does not support mutable operations

a    0
b    1
c    2
dtype: int64

In [68]:
labels = pd.Index(np.arange(3))
print(labels)
print('---')
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

Int64Index([0, 1, 2], dtype='int64')
---

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
# Practice

In [3]:

import pandas as pd
# Read Game Salary
data = pd.read_csv('data/GameSalary.csv')
#data

In [5]:
# limiting the display rows
pd.set_option('display.max_rows', 5)
data

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [19]:
data.head()

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
2,10552,Leslie,Jean,F,Art,Artist,45250,Average
3,10936,Cusak,Barbara,F,Programming,Programmer,70125,Average
4,11048,Noble,Linda,M,Game Design,Senior Game Designer,72500,Excellent

In [9]:
data.tail()

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
88,26679,Whiting,Sarah,F,Animation,Animator,52500,Good
89,26813,Denver,Jan,F,Programming,Programmer,58400,Average
90,26896,Bermont,Thomas,M,Programming,Lead Programmer,120000,Excellent
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [18]:
data.shape

(93, 8)

In [10]:
data.describe()

                 ID         Salary
count     93.000000      93.000000
mean   19267.075269   62346.182796
...             ...            ...
75%    23484.000000   70125.000000
max    27474.000000  120000.000000

[8 rows x 2 columns]

In [28]:
print(data.columns)
print(data.index)

Index(['ID', 'Last Name', 'First Name', 'Gender', 'Department', 'Title',
       'Salary', 'Performance'],
      dtype='object')
RangeIndex(start=0, stop=93, step=1)

In [20]:
# show the last name column
data['Last Name']

0       Aikman
1       Felser
        ...
91    De Maria
92       Elway
Name: Last Name, Length: 93, dtype: object

In [21]:
# show the fist name and last name column
data[['Last Name','First Name']]

   Last Name First Name
0     Aikman       Gary
1     Felser    Cynthia
..       ...        ...
91  De Maria     Cristi
92     Elway    William

[93 rows x 2 columns]

In [26]:
# show the fist row
print(data)
print(data.head(1))
print(data.loc[0])
print(data.loc[[0,3]])

       ID Last Name First Name Gender    Department                  Title  \
0   10000    Aikman       Gary      F  Sound Design  Senior Sound Designer
1   10387    Felser    Cynthia      F     Animation          Lead Animator
..    ...       ...        ...    ...           ...                    ...
91  27244  De Maria     Cristi      F   Programming             Programmer
92  27474     Elway    William      M   Programming             Programmer

    Salary Performance
0    67000     Average
1    80000        Good
..     ...         ...
91   90000   Excellent
92   75000        Good

[93 rows x 8 columns]
      ID Last Name First Name Gender    Department                  Title  \
0  10000    Aikman       Gary      F  Sound Design  Senior Sound Designer

   Salary Performance
0   67000     Average
ID               10000
Last Name       Aikman
                ...
Salary           67000
Performance    Average
Name: 0, Length: 8, dtype: object
      ID Last Name First Name Gender    Department                  Title  \
0  10000    Aikman       Gary      F  Sound Design  Senior Sound Designer
3  10936     Cusak    Barbara      F   Programming             Programmer

   Salary Performance
0   67000     Average
3   70125     Average

In [31]:
# Add a new column
data['email']='stu@eastwest.edu'
data

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance,email
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average,stu@eastwest.edu
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good,stu@eastwest.edu
...,...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent,stu@eastwest.edu
92,27474,Elway,William,M,Programming,Programmer,75000,Good,stu@eastwest.edu